# Многострочность.

# Напишите программу, которая создает и выводит на экран строки, объявленные различными способами:
# Строку с использованием одинарных кавычек.
# Строку с использованием двойных кавычек.
# Многострочную строку с использованием тройных кавычек.

# Напишите тут ваш код

my_string1 = 'one '
my_string2 = "two "
my_string3 = """t
h
r
e
e"""

print(my_string1 + my_string2 + my_string3)
