# Возраст это только цифра

# Создайте переменную birth_year и присвойте ей ваш год рождения.
# Создайте переменную current_year и присвойте ей текущий год.
# Вычислите ваш возраст и сохраните его в переменную current_age. Выведите ее на экран.

# Напишите тут ваш код

birth_year = 1988
current_year = 2025
current_age = current_year - birth_year
print(current_age)

