# Экранирование

# Напишите программу, которая создает и выводит на экран строки:
# Строку с вложенными кавычками с использованием разных типов кавычек.
# Строку с вложенными кавычками с использованием экранирования.

# Напишите тут ваш код

my_string = "cafe 'Isabella' in Maribor"
my_string2 = "cafe \"Isabella\" in Maribor"
print(my_string)
print(my_string2)