# Произвольная программа

# Напишите программу, которая создает список из произвольных элементов,
# выводит длину списка, а затем первый и последний элемент списка.

# Напишите тут ваш код

random_list = [1, 2, 3, 4, 5, 'hui', 'pizda']
print(len(random_list))
print(random_list[0])
print(random_list[-1])