# Ищем ключи.

# Напишите программу, которая создает словарь с информацией о книге
# (например, название, автор, год издания). Программа должна:
# Вывести все ключи словаря с использованием метода keys().
# Итерировать по всем ключам и вывести их на экран.

# Напишите тут ваш код

my_dict3 = {'название':'Alice', 'автор':'Zizek', 'год издания': 1988}
for key in my_dict3.keys():
    print(key)