# Генератор квадратов

# Напишите программу, которая создает список квадратов чисел от
# 1 до 10 с использованием List Comprehension.
# Программа должна вывести полученный список.

# Напишите тут ваш код

square_list = [i**2 for i in range(1,11)]
print(square_list)