# Всем привет!

# Напиши программу, которая выводит на экран строку "Привет!" на:
# Китайском
# Японском
# Арабском
# Тайском
# Тамильском

# Напишите тут ваш код

print('你好')
print('こんにちは')
print('مرحبًا')
print('สวัสดี')
print('வணக்கம்')