# Генератор квадратов

# Напишите программу, которая создает множество квадратов
# чисел от 1 до 10 с использованием генератора множеств.
# Программа должна вывести полученное множество.

# Напишите тут ваш код

my_set = {i ** 2 for i in range(1, 11)}
print(my_set)