# Семицветик

# Напишите программу, которая создает множество из 7 элементов -
# названий цветов (color).
# Программа должна вывести все элементы созданного
# множества на экран.

# Напишите тут ваш код

my_colours = {'red', 'orange', 'yellow', 'green', 'light blue', 'blue', 'violet'}
print(my_colours)