# Запаковка

# Напиши программу, которая содержит словарь, который
# содержит список, который содержит словарь, который
# содержит список, который содержит строку.

# Напишите тут ваш код

my_dict = {'key1': ['element1', 'element2', {'key2': 454, 'kez3':[1,2,3, 'biog']}]}
print(my_dict)