# Извлечение подстрок.

# Напишите программу, которая принимает строку от пользователя и
# извлекает из нее подстроки с использованием срезов.
# Программа должна:
# Извлечь подстроку с 3-го по 8-й символ (индекс) включительно.
# Извлечь подстроку с 5-го символа (индекса) до конца строки.
# Вывести обе подстроки.

# Напишите тут ваш код

my_string = input('input a string: ')
print(my_string)
print(my_string[3:9])
print(my_string[5:])