# Это не смешно

# Напишите программу, которая выводит на экран несколько
# смайликов (😀, 🤣, 😂), используя их Unicode-коды.

# Напишите тут ваш код

print(u'\U0001F600')
print(u'\U0001F923')
print(u'\U0001F602')