# Welcome

# Создайте переменную name и присвойте ей ваше имя.
# Выведите сообщение "Привет, {имя}" используя функцию print() и вашу переменную.

# Напишите тут ваш код
name = 'jonh doe'
print(f'Привет,  {name}')
