# Создание множеств.
import random

# Напиши программу, которая создает 5 множеств:
# множество с 0 элементов,
# множество с 1 элементом,
# множество с 5 элементами,
# множество с 100 элементами,
# множество с 1000 элементами

# Напишите тут ваш код

my_set0 = set()
my_set1 = set([1])
my_set5 = {1 + i for i in range(5)}
my_set100 = {1 + i for i in range(100)}
my_set1000 = {1 + i for i in range(1000)}
print(my_set0, my_set1, my_set5, my_set100, my_set1000)