# Welcome

# Выведите на экран любую понравившуюся вам фразу.

# Напишите тут ваш код

print ('this time i can do it!')